src/cf/Catalogs/Подвиды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Catalog>
		<Properties>
			<Name>Подвиды</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ИдентификаторыОбъектовМетаданных</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяПредопределеного</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Реквизит</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизиты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Владелец</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизиты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ключ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/Подвиды/Ext/ManagerModule.bsl
Процедура ОбновитьПредопределенныеСервер() Экспорт
	КлассификаторXML=Справочники.Подвиды.ПолучитьМакет("Предопределенные").ПолучитьТекст();

	дзДанные=ОбщегоНазначения.ПрочитатьXMLВТаблицу(КлассификаторXML).Данные;
	Для каждого СтрокаКоллекции Из дзДанные Цикл		
		Владелец=УправлениеКонфигурациейСервер.ИдентификаторОбъектовМетаданныхСсылка("Документ_"+СтрокаКоллекции.DocName);
		СправочникСсылка=Справочники.Подвиды.НайтиПоРеквизиту("ИмяПредопределеного", СтрокаКоллекции.ID,,Владелец);
		Если СправочникСсылка.Пустая() Тогда
			СправочникСсылка=Справочники.Подвиды.СоздатьЭлемент();
			СправочникСсылка.Наименование=СтрокаКоллекции.Name;
			СправочникСсылка.ИмяПредопределеного=СтрокаКоллекции.ID;
			СправочникСсылка.Владелец=Владелец;
			СправочникСсылка.Записать();
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
